10/data/attachments/33b0d0d57f999371.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>William_attack_Friend_98174_4</nif:username>
            <nif:friendToBeRequested>soap_friends_b330e9f4-24c4-4077-81b1-730437590a80</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>